In [1]:
import pandas as pd
import mysql.connector

In [2]:
data=pd.read_csv("providers_data.csv")

In [3]:
data

,Provider_ID,Name,Type,Address,City,Contact
0,1,Gonzales-Cochran,Supermarket,"74347 Christopher Extensions\nAndreamouth, OK ...",New Jessica,+1-600-220-0480
1,2,"Nielsen, Johnson and Fuller",Grocery Store,"91228 Hanson Stream\nWelchtown, OR 27136",East Sheena,+1-925-283-8901x6297
2,3,Miller-Black,Supermarket,"561 Martinez Point Suite 507\nGuzmanchester, W...",Lake Jesusview,001-517-295-2206
3,4,"Clark, Prince and Williams",Grocery Store,"467 Bell Trail Suite 409\nPort Jesus, IA 61188",Mendezmouth,556.944.8935x401
4,5,Coleman-Farley,Grocery Store,"078 Matthew Creek Apt. 319\nSaraborough, MA 53978",Valentineside,193.714.6577
...,...,...,...,...,...,...
995,996,"Vasquez, Ruiz and Flowers",Restaurant,"84308 Justin Stravenue\nNew Amberside, NE 53447",Williamview,+1-319-378-7627x0682
996,997,Garza-Williams,Catering Service,"08864 Figueroa Radial Suite 948\nJennaberg, AZ...",East Rossside,001-924-441-3963x746
997,998,Novak Group,Grocery Store,"934 Zachary Run\nMelissamouth, WY 02729",Joshuastad,(903)642-1969x3300
998,999,Moody Ltd,Grocery Store,"17580 Ernest Hills\nLake Michaelmouth, OR 56416",Stevenchester,637.300.3664x4880
999,1000,Jenkins-Brooks,Restaurant,"53390 Evans Rapids Suite 982\nLake Meghan, MO ...",Brendantown,266-324-3458x95775

In [4]:
data_recivers=pd.read_csv("receivers_data.csv")

In [5]:
data_recivers

,Receiver_ID,Name,Type,City,Contact
0,1,Donald Gomez,Shelter,Port Carlburgh,(955)922-5295
1,2,Laurie Ramos,Individual,Lewisburgh,761.042.1570
2,3,Ashley Mckee,NGO,South Randalltown,691-023-0094x856
3,4,Erika Rose,NGO,South Shaneville,8296491111
4,5,John Romero,Individual,Bakerport,067.491.0154
...,...,...,...,...,...
995,996,Matthew Curtis,Shelter,Lanechester,127-889-4442x1289
996,997,Amanda Cain,NGO,New Steven,+1-001-491-5601x5316
997,998,Theodore Briggs,Individual,South Sandra,930-609-9442x5031
998,999,Cheyenne Ramsey,NGO,Lake Jeffery,001-326-320-4816x15300
999,1000,April Miller,Shelter,Shelbychester,894-873-2652x23999

In [6]:
data_claim=pd.read_csv("claims_data.csv")

In [39]:
data_claim

     Claim_ID  Food_ID  Receiver_ID     Status        Timestamp
0           1      164          908    Pending    3/5/2025 5:26
1           2      353          391  Cancelled  3/11/2025 10:24
2           3      626          492  Completed   3/21/2025 0:59
3           4       61          933  Cancelled    3/4/2025 9:08
4           5      345          229    Pending  3/14/2025 15:17
..        ...      ...          ...        ...              ...
995       996      855          211  Completed  3/13/2025 19:40
996       997      980          746  Cancelled  3/17/2025 22:04
997       998      832          967  Cancelled  3/13/2025 18:00
998       999      917           90  Completed   3/1/2025 15:31
999      1000      596          950  Cancelled  3/13/2025 12:51

[1000 rows x 5 columns]

In [8]:
data_food=pd.read_csv("food_listings_data.csv")

In [9]:
data_food

,Food_ID,Food_Name,Quantity,Expiry_Date,Provider_ID,Provider_Type,Location,Food_Type,Meal_Type
0,1,Bread,43,3/17/2025,110,Grocery Store,South Kellyville,Non-Vegetarian,Breakfast
1,2,Soup,22,3/24/2025,791,Grocery Store,West James,Non-Vegetarian,Dinner
2,3,Fruits,46,3/28/2025,478,Catering Service,Lake Regina,Vegan,Breakfast
3,4,Fruits,15,3/16/2025,930,Restaurant,Kellytown,Vegan,Lunch
4,5,Soup,14,3/19/2025,279,Restaurant,Garciaport,Vegan,Dinner
...,...,...,...,...,...,...,...,...,...
995,996,Fish,15,3/30/2025,467,Catering Service,Phillipsfort,Vegan,Breakfast
996,997,Fish,22,3/18/2025,35,Grocery Store,Andersonmouth,Vegetarian,Breakfast
997,998,Fruits,6,3/22/2025,444,Restaurant,New Billy,Non-Vegetarian,Dinner
998,999,Pasta,15,3/30/2025,702,Supermarket,Lake Mistyton,Non-Vegetarian,Lunch
999,1000,Salad,18,3/19/2025,155,Supermarket,Charlesview,Non-Vegetarian,Dinner

In [10]:
import sys
print(sys.executable)

c:\Users\Dell\anaconda3\python.exe

In [11]:


# Attempt to connect to MySQL and show an explicit error if it fails
try:
    connection = mysql.connector.connect(
        host="localhost",
        user="root",
        password="root",      # use your MySQL password
        database="project"
    )
    cursor = connection.cursor()
    print("Connected to MySQL successfully")
except mysql.connector.Error as err:
    # Print the underlying MySQL error so the user can diagnose it
    print("Error connecting to MySQL:", err)
    # Ensure variables exist even if connection failed
    connection = None
    cursor = None

Connected to MySQL successfully

In [ ]:
# cursor.execute("""Create table recievers(Receiver_ID int primary key, name varchar(100), type varchar(100), city varchar(50),contact varchar(50))""")
for _, row in data_recivers.iterrows():
    sql = "INSERT INTO  recievers (Receiver_ID, name, type,city,contact) VALUES (%s, %s, %s, %s,%s)"
    cursor.execute(sql, tuple(row))
connection.commit()

In [11]:
data_food.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 9 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Food_ID        1000 non-null   int64
 1   Food_Name      1000 non-null   object
 2   Quantity       1000 non-null   int64
 3   Expiry_Date    1000 non-null   object
 4   Provider_ID    1000 non-null   int64
 5   Provider_Type  1000 non-null   object
 6   Location       1000 non-null   object
 7   Food_Type      1000 non-null   object
 8   Meal_Type      1000 non-null   object
dtypes: int64(3), object(6)
memory usage: 70.4+ KB

In [12]:
data_food['Expiry_Date'] = pd.to_datetime(data_food['Expiry_Date'], errors='coerce')

In [13]:
data_food.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 9 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Food_ID        1000 non-null   int64
 1   Food_Name      1000 non-null   object
 2   Quantity       1000 non-null   int64
 3   Expiry_Date    1000 non-null   datetime64[ns]
 4   Provider_ID    1000 non-null   int64
 5   Provider_Type  1000 non-null   object
 6   Location       1000 non-null   object
 7   Food_Type      1000 non-null   object
 8   Meal_Type      1000 non-null   object
dtypes: datetime64[ns](1), int64(3), object(5)
memory usage: 70.4+ KB

In [14]:
data_food.head()

,Food_ID,Food_Name,Quantity,Expiry_Date,Provider_ID,Provider_Type,Location,Food_Type,Meal_Type
0,1,Bread,43,2025-03-17,110,Grocery Store,South Kellyville,Non-Vegetarian,Breakfast
1,2,Soup,22,2025-03-24,791,Grocery Store,West James,Non-Vegetarian,Dinner
2,3,Fruits,46,2025-03-28,478,Catering Service,Lake Regina,Vegan,Breakfast
3,4,Fruits,15,2025-03-16,930,Restaurant,Kellytown,Vegan,Lunch
4,5,Soup,14,2025-03-19,279,Restaurant,Garciaport,Vegan,Dinner

In [ ]:
#cursor.execute("""Create table foodlisting(Food_ID int primary key, Food_Name varchar(100), Quantity varchar(100), Expiry_Date date,Provider_ID varchar(10),Provider_Type varchar(50),Location varchar(50),Food_Type varchar(50),Meal_Type varchar(50))""")
for _, row in data_food.iterrows():
    sql = "INSERT INTO  foodlisting (Food_ID, Food_Name, Quantity,Expiry_Date,Provider_ID,Provider_Type,Location,Food_Type,Meal_Type) VALUES (%s, %s, %s, %s,%s,%s,%s,%s,%s)"
    cursor.execute(sql, tuple(row))
connection.commit()

In [ ]:
#cursor.execute("""Create table 
               #claims(Claim_ID int primary key, Food_ID int, Receiver_ID int,Status varchar(200), Timestamp varchar(50))""")
for _, row in data_claim.iterrows():
    sql = "INSERT INTO claims (Claim_ID, Food_ID, Receiver_ID, Status,Timestamp) VALUES (%s, %s, %s, %s,%s)"
    cursor.execute(sql, tuple(row))
connection.commit()

In [ ]:
for _, row in data.iterrows():
    sql = "INSERT INTO providers (id, name, type, address,city,contact) VALUES (%s, %s, %s, %s,%s,%s)"
    cursor.execute(sql, tuple(row))
connection.commit()

1. Which type of food provider (restaurant, grocery store, etc.) contributes the most food?

In [12]:
cursor.execute("Select type ,count(*) from providers group by type order by count(*) desc")
result=cursor.fetchall()
pd.DataFrame(result,columns=['provider_type','count'])

      provider_type  count
0       Supermarket    262
1     Grocery Store    256
2        Restaurant    246
3  Catering Service    236

2. What is the contact information of food providers in a specific city?

In [13]:
cursor.execute("select contact from providers where city='Brendantown'")
result=cursor.fetchall()
pd.DataFrame(result,columns=['contact'])

              contact
0  266-324-3458x95775

3.How many food providers and receivers are there in each city?

In [14]:
cursor.execute("""SELECT 
    City,
    COUNT(id) AS total_providers,
    COUNT(Receiver_ID) AS total_receivers
FROM (
    SELECT City, id, NULL AS Receiver_ID FROM providers
    UNION ALL
    SELECT City, NULL AS id, Receiver_ID FROM recievers
) AS combined
GROUP BY City; """)
result=cursor.fetchall()
pd.DataFrame(result,columns=['city','total_providers','total_receivers'])

                city  total_providers  total_receivers
0        New Jessica                1                1
1        East Sheena                1                0
2     Lake Jesusview                1                0
3        Mendezmouth                1                0
4      Valentineside                1                0
...              ...              ...              ...
1873     Andrewsport                0                1
1874     Lanechester                0                1
1875    South Sandra                0                1
1876    Lake Jeffery                0                1
1877   Shelbychester                0                1

[1878 rows x 3 columns]

4.Which receivers have claimed the most food?

In [15]:
cursor.execute(""" SELECT 
    r.Receiver_ID,
    r.Name AS Receiver_Name,
    r.Type AS Receiver_Type,
    COUNT(c.Claim_ID) AS Total_Claims
FROM 
    claims c
JOIN 
    recievers r ON c.Receiver_ID = r.Receiver_ID
GROUP BY 
    r.Receiver_ID, r.Name, r.Type
ORDER BY 
    Total_Claims DESC;

""")
result=cursor.fetchall()
pd.DataFrame(result,columns=['Receiver_ID','Receiver_name','Receiver_type','Total_claims'])

     Receiver_ID      Receiver_name Receiver_type  Total_claims
0            371  William Frederick           NGO             5
1            276       Scott Hunter    Individual             5
2            800     Anthony Garcia    Individual             5
3            742       Matthew Webb       Charity             5
4            493     Chelsea Powell       Charity             4
..           ...                ...           ...           ...
619          943      Rebecca Lucas       Charity             1
620          984        Steve Kirby       Charity             1
621          211      Judy Griffith       Charity             1
622          746     Kenneth Barnes           NGO             1
623          967   Samantha Sherman    Individual             1

[624 rows x 4 columns]

5.Which city has the highest number of food listings?

In [16]:
cursor.execute(""" select location,count(food_ID) from foodlisting group by location order by count(food_ID) desc
""")
result=cursor.fetchall()
pd.DataFrame(result,columns=['Location','count'])

                 Location  count
0               New Carol      6
1           South Kathryn      6
2               Jimmyberg      5
3               Perezport      5
4             East Angela      5
..                    ...    ...
619        Lake Coryhaven      1
620  Port Daniellechester      1
621         Andersonmouth      1
622             New Billy      1
623           Charlesview      1

[624 rows x 2 columns]

6.What are the most commonly available food types?

In [17]:
cursor.execute(""" select Food_Name,count(food_ID) from foodlisting group by Food_Name order by count(food_ID) desc
""")
result=cursor.fetchall()
pd.DataFrame(result,columns=['Food_Name','count'])

    Food_Name  count
0        Rice    114
1        Soup    111
2       Salad    105
3       Dairy    103
4     Chicken    103
5       Pasta    102
6       Bread     98
7        Fish     92
8  Vegetables     91
9      Fruits     81

7.What is the total quantity of food available from all providers?

In [18]:
cursor.execute(""" select provider_ID,count(provider_ID) as Total from foodlisting group by provider_ID  order by Total desc """)
result=cursor.fetchall()
pd.DataFrame(result,columns=["Provider_ID","Total"])

    Provider_ID  Total
0           709      6
1           655      5
2           161      5
3           563      5
4           306      4
..          ...    ...
632         257      1
633         470      1
634          35      1
635         444      1
636         155      1

[637 rows x 2 columns]

8.How many food claims have been made for each food item?

In [40]:
cursor.execute(""" select f.Food_Name,count(c.Food_ID) as Total_Claims
               from claims c 
               join foodlisting f
               on c.Food_ID=f.Food_ID
               where c.Status="Completed"
               group by f.Food_Name  
               order by Total_Claims desc
""")
result=cursor.fetchall()
pd.DataFrame(result,columns=["Food_Name","Total_Claims"])

    Food_Name  Total_Claims
0       Bread            42
1        Soup            41
2       Salad            37
3        Rice            36
4       Dairy            36
5  Vegetables            33
6        Fish            33
7     Chicken            31
8       Pasta            30
9      Fruits            20

9.Which receiver has had the highest number of successful food claims?

In [21]:
data_claim.head()

   Claim_ID  Food_ID  Receiver_ID     Status        Timestamp
0         1      164          908    Pending    3/5/2025 5:26
1         2      353          391  Cancelled  3/11/2025 10:24
2         3      626          492  Completed   3/21/2025 0:59
3         4       61          933  Cancelled    3/4/2025 9:08
4         5      345          229    Pending  3/14/2025 15:17

In [41]:
cursor.execute(""" select Receiver_ID, count(Receiver_ID) as total_claims
                from claims  where Status='Completed'
               group by Receiver_ID 
               order by total_claims desc
""")
result=cursor.fetchall()
pd.DataFrame(result,columns=['Receiver_ID','Total_claims'])

     Receiver_ID  Total_claims
0             45             3
1            505             3
2            482             3
3            729             2
4            601             2
..           ...           ...
288          553             1
289          113             1
290          875             1
291          394             1
292          211             1

[293 rows x 2 columns]

 10. What percentage of food claims are completed vs. pending vs. canceled?

In [23]:
cursor.execute("""SELECT 
    Status,
    COUNT(*) AS Count,
    ROUND((COUNT(*) / (SELECT COUNT(*) FROM claims) * 100), 2) AS Percentage
FROM 
    claims
GROUP BY 
    Status;""")
result=cursor.fetchall()
pd.DataFrame(result,columns=["Status","count","Percentage"])

      Status  count Percentage
0    Pending    325      32.50
1  Cancelled    336      33.60
2  Completed    339      33.90

11. Which meal type (breakfast, lunch, dinner, snacks) is claimed the most?

In [42]:
cursor.execute("""Select f.Meal_Type,count(c.Food_ID)as Total  from foodlisting f
               join claims c
               on f.Food_ID=c.Food_ID
               where c.Status="Completed"
               group by f.Meal_Type
               order by Total desc
""")
result=cursor.fetchall()
pd.DataFrame(result,columns=["Meal_Type","Total"])

   Meal_Type  Total
0  Breakfast     95
1     Dinner     86
2      Lunch     84
3     Snacks     74

12.What is the total quantity of food donated by each provider?

In [27]:
cursor.execute(""" Select Provider_ID, sum(Quantity) as Total_Quantity 
               from foodlisting 
               group by Provider_ID 
               order by Total_Quantity desc
               
""")
result=cursor.fetchall()
pd.DataFrame(result,columns=['Provider_ID','Total_Quantity'])

    Provider_ID  Total_Quantity
0           709           179.0
1           306           158.0
2           655           150.0
3           315           142.0
4           678           140.0
..          ...             ...
632         258             1.0
633         184             1.0
634         849             1.0
635         870             1.0
636         745             1.0

[637 rows x 2 columns]

13. What is the average quantity of food claimed per receiver?

In [30]:
cursor.execute(""" select c.Receiver_ID, avg(f.Quantity) as Avg 
               from claims c 
               join 
               foodlisting f 
               group by c.Receiver_ID 
               order by Avg desc
""")
result=cursor.fetchall()
pd.DataFrame(result,columns=['Receiver_ID','Average_Quantity'])

     Receiver_ID  Average_Quantity
0            950            25.794
1             90            25.794
2            967            25.794
3            746            25.794
4            211            25.794
..           ...               ...
619          836            25.794
620          739            25.794
621          975            25.794
622          807            25.794
623          229            25.794

[624 rows x 2 columns]

14. Providers with highest average quantity per listing

In [48]:
# Average quantity per listing by provider (SQL)
cursor.execute("""SELECT Provider_ID, AVG(Quantity) AS Avg_Quantity
               FROM foodlisting
               GROUP BY Provider_ID
               ORDER BY Avg_Quantity DESC
""")
result = cursor.fetchall()
pd.DataFrame(result, columns=['Provider_ID','Avg_Quantity'])

    Provider_ID  Avg_Quantity
0           179          50.0
1           909          50.0
2           404          50.0
3           185          50.0
4           573          50.0
..          ...           ...
632         258           1.0
633         184           1.0
634         849           1.0
635         870           1.0
636         745           1.0

[637 rows x 2 columns]

15. Providers with largest variety of food items (distinct Food_Name)

In [44]:
# Providers with largest variety of food items (SQL)
cursor.execute("""SELECT Provider_ID, COUNT(DISTINCT Food_Name) AS Distinct_Food_Count
               FROM foodlisting
               GROUP BY Provider_ID
               ORDER BY Distinct_Food_Count DESC
""")
result = cursor.fetchall()
pd.DataFrame(result, columns=['Provider_ID','Distinct_Food_Count'])

     Provider_ID  Distinct_Food_Count
361          563                    5
475          752                    4
632          995                    4
106          161                    4
221          332                    4
..           ...                  ...
349          547                    1
348          541                    1
347          540                    1
346          539                    1
636         1000                    1

[637 rows x 2 columns]

17. Distribution of provider types across cities

In [47]:
# Distribution of provider types across cities (SQL)
cursor.execute("""SELECT City, Type AS Provider_Type, COUNT(*) AS count
               FROM providers
               GROUP BY City, Type
               ORDER BY City, count DESC
""")
result = cursor.fetchall()
pd.DataFrame(result, columns=['City','Provider_Type','count'])

                 City              Type  count
0            Adambury  Catering Service      1
1           Adamsview        Restaurant      1
2          Adamsville        Restaurant      1
3        Aguirreville       Supermarket      1
4    Alexanderchester  Catering Service      1
..                ...               ...    ...
984       Wrightville  Catering Service      1
985         Yatesside       Supermarket      1
986      Youngchester        Restaurant      1
987      Zimmermanton  Catering Service      1
988    Zimmermanville        Restaurant      1

[989 rows x 3 columns]

18. Claims status breakdown overall and by provider type

In [62]:
# Claims status breakdown overall and by provider type (SQL)
cursor.execute("""SELECT Status, COUNT(*) AS Count, ROUND((COUNT(*)/(SELECT COUNT(*) FROM claims)*100),2) AS Percentage
               FROM claims
               GROUP BY Status
""")
result = cursor.fetchall()
status_counts = pd.DataFrame(result, columns=['Status','Count','Percentage'])
# Breakdown by provider type
cursor.execute("""SELECT f.Provider_Type, c.Status, COUNT(*) AS Count
               FROM claims c
               JOIN foodlisting f ON c.Food_ID = f.Food_ID
               GROUP BY f.Provider_Type, c.Status
               ORDER BY f.Provider_Type, Count DESC
""")
result = cursor.fetchall()
by_provider_type = pd.DataFrame(result, columns=['Provider_Type','Status','Count'])
status_counts
by_provider_type

       Provider_Type     Status  Count
0   Catering Service  Cancelled     86
1   Catering Service  Completed     80
2   Catering Service    Pending     78
3      Grocery Store  Completed     88
4      Grocery Store  Cancelled     84
5      Grocery Store    Pending     75
6         Restaurant  Completed     89
7         Restaurant  Cancelled     88
8         Restaurant    Pending     80
9        Supermarket    Pending     92
10       Supermarket  Completed     82
11       Supermarket  Cancelled     78

19. Cancellation rate per provider (cancelled / total claims for provider)

In [63]:
# Cancellation rate per Provider_ID
claims_food = data_claim.merge(data_food, on='Food_ID', how='left')
total_by_provider = claims_food.groupby('Provider_ID').size().reset_index(name='Total_Claims')
cancelled_by_provider = claims_food[claims_food['Status'].str.lower()=='cancelled'].groupby('Provider_ID').size().reset_index(name='Cancelled')
cancel_rate = total_by_provider.merge(cancelled_by_provider, on='Provider_ID', how='left').fillna(0)
cancel_rate['Cancelled'] = cancel_rate['Cancelled'].astype(int)
cancel_rate['Cancellation_Rate'] = (cancel_rate['Cancelled'] / cancel_rate['Total_Claims'] * 100).round(2)
cancel_rate.sort_values('Cancellation_Rate', ascending=False)

     Provider_ID  Total_Claims  Cancelled  Cancellation_Rate
236          495             2          2              100.0
208          434             1          1              100.0
218          461             1          1              100.0
220          464             3          3              100.0
229          478             2          2              100.0
..           ...           ...        ...                ...
55           112             1          0                0.0
271          554             2          0                0.0
272          555             1          0                0.0
54           111             1          0                0.0
287          587             1          0                0.0

[472 rows x 4 columns]

20. Claims per day (time-series)

In [54]:
# Parse Timestamp and aggregate claims per day
data_claim['Timestamp'] = pd.to_datetime(data_claim['Timestamp'], errors='coerce')
claims_by_day = data_claim.groupby(data_claim['Timestamp'].dt.date).size().reset_index(name='Count').rename(columns={'Timestamp':'Date'})
claims_by_day = claims_by_day.sort_values(by='Timestamp') if 'Timestamp' in claims_by_day.columns else claims_by_day
claims_by_day

          Date  Count
0   2025-03-01     40
1   2025-03-02     47
2   2025-03-03     46
3   2025-03-04     44
4   2025-03-05     47
5   2025-03-06     37
6   2025-03-07     53
7   2025-03-08     56
8   2025-03-09     40
9   2025-03-10     60
10  2025-03-11     44
11  2025-03-12     52
12  2025-03-13     62
13  2025-03-14     51
14  2025-03-15     51
15  2025-03-16     45
16  2025-03-17     54
17  2025-03-18     57
18  2025-03-19     50
19  2025-03-20     45
20  2025-03-21     19

21. Receivers that have never had a completed claim (or zero claims)

In [64]:
# Receivers with zero completed claims
completed = data_claim[data_claim['Status'].str.lower()=='completed']
receivers_with_completed = completed['Receiver_ID'].unique()
receivers_never_completed = data_recivers[~data_recivers['Receiver_ID'].isin(receivers_with_completed)]
receivers_never_completed

,Receiver_ID,Name,Type,City,Contact
1,2,Laurie Ramos,Individual,Lewisburgh,761.042.1570
2,3,Ashley Mckee,NGO,South Randalltown,691-023-0094x856
3,4,Erika Rose,NGO,South Shaneville,8296491111
4,5,John Romero,Individual,Bakerport,067.491.0154
7,8,James Perez,Charity,Benjaminburgh,+1-986-748-6688
...,...,...,...,...,...
993,994,Angelica Simmons,NGO,Port Kellifort,(902)942-8232
995,996,Matthew Curtis,Shelter,Lanechester,127-889-4442x1289
996,997,Amanda Cain,NGO,New Steven,+1-001-491-5601x5316
997,998,Theodore Briggs,Individual,South Sandra,930-609-9442x5031
998,999,Cheyenne Ramsey,NGO,Lake Jeffery,001-326-320-4816x15300

22. Top food items by average quantity per claim

In [65]:
# Average quantity from food listings for claimed items by Food_Name
claimed = data_claim.merge(data_food, on='Food_ID', how='left')
avg_qty_by_food = claimed.groupby('Food_Name')['Quantity'].mean().reset_index().rename(columns={'Quantity':'Avg_Quantity'}).sort_values('Avg_Quantity', ascending=False)
avg_qty_by_food

    Food_Name  Avg_Quantity
0       Bread     30.457447
7       Salad     28.188679
6        Rice     27.885246
4      Fruits     27.492958
2       Dairy     26.954545
8        Soup     25.754386
9  Vegetables     24.941860
5       Pasta     23.459770
1     Chicken     22.637255
3        Fish     21.833333

23. Providers with no claims

In [66]:
# Providers whose listings were never claimed
claimed_food_ids = data_claim['Food_ID'].unique()
providers_with_claims = data_food[data_food['Food_ID'].isin(claimed_food_ids)]['Provider_ID'].unique()
providers_no_claims = data[~data['Provider_ID'].isin(providers_with_claims)]
providers_no_claims

,Provider_ID,Name,Type,Address,City,Contact
2,3,Miller-Black,Supermarket,"561 Martinez Point Suite 507\nGuzmanchester, W...",Lake Jesusview,001-517-295-2206
4,5,Coleman-Farley,Grocery Store,"078 Matthew Creek Apt. 319\nSaraborough, MA 53978",Valentineside,193.714.6577
5,6,Lawson-Walters,Grocery Store,"1889 Barnes Gateway\nAdamview, ID 87971",Shannonside,144-860-6074x60544
7,8,Curtis-Lewis,Supermarket,"4770 Miller Light Suite 260\nNew Charlesville,...",Washingtonville,+1-521-027-8120x3301
9,10,"Hall, Nguyen and Martinez",Catering Service,"71458 Mark Field Apt. 252\nNorth Alexland, TX ...",West Cherylfort,(740)949-2480x40566
...,...,...,...,...,...,...
991,992,Miller-Sanders,Grocery Store,"896 Karen Island Apt. 800\nJohnsontown, NJ 75055",Browninghaven,648.599.6844
993,994,"Porter, Hernandez and Pace",Catering Service,"3564 Hutchinson Shore\nSouth Danielle, DC 15667",Amyport,001-279-802-3400x771
995,996,"Vasquez, Ruiz and Flowers",Restaurant,"84308 Justin Stravenue\nNew Amberside, NE 53447",Williamview,+1-319-378-7627x0682
996,997,Garza-Williams,Catering Service,"08864 Figueroa Radial Suite 948\nJennaberg, AZ...",East Rossside,001-924-441-3963x746
999,1000,Jenkins-Brooks,Restaurant,"53390 Evans Rapids Suite 982\nLake Meghan, MO ...",Brendantown,266-324-3458x95775

24. Distribution: listings per provider (mean, median, percentiles)

In [67]:
# Stats for listings per provider
listings_count = data_food.groupby('Provider_ID').size().reset_index(name='Listings')
stats = listings_count['Listings'].describe(percentiles=[0.25,0.5,0.75,0.9]).to_frame().T
listings_count.sort_values('Listings', ascending=False).head(20)
cursor.execute(
"""select f.Food_Name, count(c.Claim_ID) as Total_cancelled 
               from foodlisting f 
               join
               claims c where c.status='Cancelled'
               group by f.Food_Name
               order by Total_cancelled desc
""")
result=cursor.fetchall()
pd.DataFrame(result,columns=['Food_Name','Total_Cancelled'])

    Food_Name  Total_Cancelled
0        Rice            38304
1        Soup            37296
2       Salad            35280
3       Dairy            34608
4     Chicken            34608
5       Pasta            34272
6       Bread            32928
7        Fish            30912
8  Vegetables            30576
9      Fruits            27216

25. Total number of Food items for each provider Type

In [68]:
cursor.execute("""select Provider_Type, count(Food_ID) as Total_Food_items
                from foodlisting
               group by provider_type
order by Total_Food_items desc
               """)
result=cursor.fetchall()
pd.DataFrame(result,columns=['Provider_Type','Total_Food_items'])

      Provider_Type  Total_Food_items
0       Supermarket               267
1        Restaurant               258
2     Grocery Store               243
3  Catering Service               232

26. which food items are pending?

In [69]:
cursor.execute("""select f.Food_Name, count(c.Claim_ID) as Total_cancelled 
               from foodlisting f 
               join
               claims c where c.status='Pending'
               group by f.Food_Name
               order by Total_cancelled desc
""")
result=cursor.fetchall()
pd.DataFrame(result,columns=['Food_Name','Total_Pending'])

    Food_Name  Total_Pending
0        Rice          37050
1        Soup          36075
2       Salad          34125
3       Dairy          33475
4     Chicken          33475
5       Pasta          33150
6       Bread          31850
7        Fish          29900
8  Vegetables          29575
9      Fruits          26325